# network
mask = "255.255.192.0"
client = "154.141.198.190"


bin_mask = [bin(int(i))[2:].zfill(8) for i in mask.split(".")]
bin_client = [bin(int(i))[2:].zfill(8) for i in client.split(".")]


print(bin_mask)
print(bin_client)


['11111111', '11111111', '11   000000', '00000000']
broadcast = ['10011010', '10001101', '11111111', '11111111']

print(
    sum([int(i, 2) for i in broadcast])
)

net = ['10011010', '10001101', '11 00000', '00000000']

pc1 = ['10011010', '10001101', '11 00000', '00000001']
pc2 = ['10011010', '10001101', '11 00000', '00000010']
pc3 = ['10011010', '10001101', '11 00000', '00000011']
pc4 = ['10011010', '10001101', '11 00000', '00000100']

broadcast = ['10011010', '10001101', '11 111111', '11111111']

2**14 # - количество ip адресов в сети
2**14 # - 2 колво компьютеров/клиентов/устройств



from math import prod

# res = 

print(prod([1, 2, 3, 4, 5]))