# Типы данных

# int, float - целые числа и вещественный
# 2, -4, 10, 10**6, 1.123, -0.4234, .4324

# + - * сложение вычитание умножение - все как в математике + скобки
# деление

# / - обычное (вещественное)
# // - целочисленное
# % - остаток от деления


# money = 100
# price = 15

# # если товар можно купить дробно (например кг)
# kolvo_kg = money/price
# print(kolvo_kg)

# kolvo_shtuk = money//price
# print(kolvo_shtuk)
# sdacha = money%price
# print(sdacha)

# остаток от деления чаще всего используется для проверки кратности
# если остаток от деления числа N на M равен нулю - то N кратно M


# for i in range(100):
#     print(i%5)

# Операторы и операнды
# операторы - знаки действий
# операнды - то, над чем совершается действи

# 5 + 7
# 5 и 7- операнды
# + - оператор

# сложение чисел

# конкатенация строк (конкатенация - это сложение текста)


# строки - str (string)
# записываюстя в кавычках
# 'hello' "hello"
# ‼️‼️‼️ СТРОКИ - НЕИЗМЕНЯЕМЫЙ ТИП ДАННЫХ ‼️‼️‼️




# print('Война и мир "Толстой" \'test\'')

# \n - новая строка \t - табуляция



# МЕТОДЫ И ФУНКЦИИ
# методы - это функции определенного класса
# функции - какие либо действия (кусок кода, который переиспользуем)

# cat = Cat() # Cat() - класс
# dog = Dog()


# функция - действия НАД объектом (чаще всего разных типов)
# метод - это действие САМОГО объекта (чаще всего одного типа)

# если нам нужно накормить кошку и собаку 

# def feed(animal):
#     ...


# feed(cat)
# feed(dog)


# cat.meow()
# dog.bark()

# cat.walk()
# dog.walk()


# Строковые методы - методы строк

# text = '012345ABCDEF Hello World helllloo     world!'
#       0123456789

# 1) верхний / нижний регистры (большие/маленькие буквы)
# text = text.upper()

# print(text.upper())
# print(text)

# print(text.lower())


# 2) поиск индекса подстроки

# print(text.find("ABCDER"))
# print(text.index("ABCDER"))

# text = '012345ABCDEF \t Hello World \n helllloo     world!'

# 3) подсчет количества подстрок в строке
# print(text.count("4"))


# 4) замена подстроки на строку
# print(text.replace('l', '_', 1))

# 5) Разбиение строки на список подстрок по разделителю
# print(len(text.split(' '))) # НЕ ИСПОЛЬЗУЕМ
# print(len(text.split()))

# соединение списка строк в строку (обратный метод к .split())

# words = ['hello', 'world', 'apple', 'banana']
# res = ' '.join(words)
# print(res)

# text = '10101'

# print(text.zfill(8))


# text = "aaaaBCBCBCBCBCBaaaaaCBBCBCBCBaaaaa"

# print(text.lstrip("a"))
# print(text.rstrip("a"))
# print(text.strip("a"))


# индексация строк
# нумерация символов идет с нуля
# допустимо использование отрицательных индексов (справа налево начиная с -1)

# text = '0123456789ABCDEF'

# print(text[0])
# print(text[11])
# print(text[-1])

# Срезы (slices)

# срезы пишутся в кв скобках []
# есть три параметра (аналогично функции range())

# text[start=0:stop:step=1]
# start - включительно
# stop - не включительно


text = '0123456789ABCDEF'

# print(text[:5]) # первые 5 символов
# print(text[3:]) # начать с 3его включительно и до конца

# 468AC
# print(text[4:14:2])

# 56789ABCD
# print(text[5:14])
# print(text[5:-2])

# переворот строки
# print(text[::-1])


# DCBA9
# print(text[-3:8:-1])


# цепочка методов - chaining 
# Задача - посчитать количество букв "п" в тексте

text = ' паврппварпРОАПЫВРОАПарпывароывпароПАРОВПАЫРАПарпвыапровыап'

# print(text.count("п") + text.count("П"))

print(text.lower().count("п"))




