# Перечислить основные типы данных, написать какие из них изменяемые и какие неизменяемые

text = "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean vulputate est vitae purus consequat commodo."

# 1) Посчитать кол-во гласных в тексте

# 2) Найти кол-во слов в тексте

# 3) Убрать все знаки препинания (есть несколько способов - подумай каким проще)



s = "QWERTY56789ASD0123"

# Получить следующие строки при помощи срезов:
# QWERTY56
# 9ASD01
# print(s[10:-2])
# QR58
# Q



# Дан список чисел - заполнить параметры методов, чтобы получился следующий список
# [90, 78, 75, 55, 90, 12, 34]
# nums = [90, 78, 75, 55, 90]

# print(nums)

# Отсортировать список по возрастанию

# Имеется список покупок
# basket = ["apple", "banana", "orange", "apple", "kiwi", "banana", "banana"]

# Выведи количество (!) уникальных фруктов в корзине
# Добавь в этот список "pineapple" и удали из списка дубли (конечный тип данных - list)


# Вывести 1ую, 2ую, 3юю цифры трехзначного числа не используя строки, а только
# математические операции
# + - * ** / // %
# num = 587



# # Написать функцию перевода из 10ой в 7ую СС

# def to_7(num):
#     ...


# # Написать функцию, которая проверяет является ли число простым

# def isPrime(num):
#     ...



nums = [9, 5, 13, 8, -1, -7, 0]



for num in nums:
    print(num)
    if num == 8:
        nums.sort()
        print(nums)
