# https://pythontutor.com/render.html#mode=edit

# Коллекции
# Циклы
# Условия


# Коллекции это типы данных, в которых есть перебор элементов (или просто элементы)
# str - строки. Элемент коллекции - символ
# list - списки. Элемент коллекции - элемент списка (ЛЮБОЙ ТИП ДАННЫХ)
# set - множества (аналог множества в математике). Элемент коллекции - элемент множества
# tuple - кортежи (неизменяемые списки). Элемент коллекции - элемент кортежа
# dict - словари. Элемент коллекции - КЛЮЧ
# генераторы (например функция range()). Элемент коллекции - элемент генератора

text = "Hello"
items = ["bow", "sword", "apple", [1, 2, 3]] # list
letters = {"a", "b", "c", "d"}
numbers = (1, 2, 3, 0, 2, 3)

message = {
    "id" : 13123,
    "from" : {
        "user" : "user24",
        "country" : "RU"
    },
    "to" : {
        "user" : "user55",
        "country" : "EN"
    }
}

# range() - генератор АРИФМЕТИЧЕСКИХ ПРОГРЕССИЙ

# цикл while

# a = 1

# while True:
#     if a == 9:
#         break
    
#     print(a)
#     a += 1
    

# for цикл

# Двумерные массивы

board = [
    [11, 12, 13, 14, 15],
    [21, 22, 23, 24, 25],
    [31, 32, 33, 34, 35],
    [41, 42, 43, 44, 45],
    [51, 52, 53, 54, 55],
]

# 33 -> *
# 11 -> *
# 45 -> *
# 53 -> *
# 51 -> *
# 15 -> *
# 22 -> *
# 54 -> *

board[2][2] = "*"

for row in board: # row - строка
    print(*row)


# ОСТАНОВИЛИСЬ НА УСЛОВИЯХ + методы списков и сетов
# if elif else


