# Поставить комментарий ctrl + / (у правого шифта)

# основные типы данных

# int float - целые числа и вещественные числа (числа с плавающей точкой (запятой))

# 5, -11, 0, 190 # int

# Операции с целыми числами

# Сложение, вычитание, умножение 
# + - *

# Возведение в степень **
# Корень n степени - **(1/n)


# Деление 
# 1) Обычное (дробное) a/b
# 2) Целочисленное a//b
# 3) Остаток от деления a%b

# money = 657
# price = 55
# kolvo = money//price # сколько мы можем купить товара
# ostatok = money%price # сколько останется после покупки МАКСИМАЛЬНОГО кол-ва товара


# float - вещественные (когда есть точка)
# результатом умножения вещественного на целое всегда будет вещественное
# результат деления - вещественное

# стараемся не использовать float 


# 17%3
# 19%7
# 7%19
# 3%1
# 188%65

# 12345%10
# 12345%100
# 12345%1000


# Строки (текст) - набор символов, записываются в кавычках

word1 = "Hello"
word2 = 'world'

# Операции со строками 
# 1) конкатенация - сложение
# 2) умножение

# print(word1 + " " +  word2) # пробелы - обычная буква, сами они не ставятся!!!!
# print(word1*5)


s = "Hello world! Lalaal apple tomato ABOBA"

# Функции - print() range() int() len()
# Методы - строковые .join() .upper(), списковые - .count() .find()
# метода это функция, которую объект применяет к себе (self function)


# cat = Cat() # переменная кошка = Экземпляр класса Кошка

# dog = Dog()


# cat.meow() # метод (функция) мяу есть только у кошек
# dog.bark() # метод (функция) гавкать есть только у собак

# feed(cat) #  функция общая - которой можно подавать разные классы объектов
# feed(dog) #

# Строковые методы...
