# def f19(s1, s2, step=1): # 1p 2v 3p 4v 5p
#     # условие выполнения задачи (победа конкретного игрока)
#     # условие по камням + условие по ходу
#     if (s1 + s2 >= 207) and (step == 3):
#         return True
#     # условие поражения игрока
#     # когда надо камней слишком мало/много
#     # либо когда нужно кол-во камней достигнуто раньше нужного хода
#     elif (
#         ((s1 + s2 >= 207) and (step < 3)) or
#         ((s1 + s2 < 207) and (step == 3))
#     ):
#         return False

#     moves = [
#         f19(s1 + 1, s2, step + 1),
#         f19(s1, s2 + 1, step + 1),
#         f19(s1*2, s2, step + 1),
#         f19(s1, s2*2, step + 1)
#     ]

#     # ПОБЕДИТЕЛЬ ВСЕГДА any()
#     # ПРОИГРАВШИЙ all() если любой ход/независимо от стратегии...
#     # ПРОИГРАВШИЙ any() когда НЕУДАЧНЫЙ ХОД
#     if step%2 == 0: # четные ходы - ВАНЯ
#         return any(moves)
#     # нечетные - ПЕТЯ
#     return any(moves)

# for s2 in range(2, 190):
#     if f19(17, s2):
#         print(s2)
#         break




# def f20(s1, s2, step=1): # 1p 2v 3p 4v 5p
#     # условие выполнения задачи (победа конкретного игрока)
#     # условие по камням + условие по ходу
#     if (s1 + s2 >= 207) and (step == 4):
#         return True
#     # условие поражения игрока
#     # когда надо камней слишком мало/много
#     # либо когда нужно кол-во камней достигнуто раньше нужного хода
#     elif (
#         ((s1 + s2 >= 207) and (step < 4)) or
#         ((s1 + s2 < 207) and (step == 4))
#     ):
#         return False

#     moves = [
#         f20(s1 + 1, s2, step + 1),
#         f20(s1, s2 + 1, step + 1),
#         f20(s1*2, s2, step + 1),
#         f20(s1, s2*2, step + 1)
#     ]

#     # ПОБЕДИТЕЛЬ ВСЕГДА any()
#     # ПРОИГРАВШИЙ all() если любой ход/независимо от стратегии...
#     # ПРОИГРАВШИЙ any() когда НЕУДАЧНЫЙ ХОД
#     if step%2 == 0: # четные ходы - ВАНЯ
#         return all(moves)
#     # нечетные - ПЕТЯ
#     return any(moves)

# for s2 in range(2, 190):
#     if f20(17, s2):
#         print(s2)
#         # break



def f21(s1, s2, step=1): # 1p 2v 3p 4v 5p
    # условие выполнения задачи (победа конкретного игрока)
    # условие по камням + условие по ходу
    if (s1 + s2 >= 207) and (step in (3,)):
        return True
    # условие поражения игрока
    # когда надо камней слишком мало/много
    # либо когда нужно кол-во камней достигнуто раньше нужного хода
    elif (
        ((s1 + s2 >= 207) and (step < 3)) or
        ((s1 + s2 < 207) and (step == 3))
    ):
        return False

    moves = [
        f21(s1 + 1, s2, step + 1),
        f21(s1, s2 + 1, step + 1),
        f21(s1*2, s2, step + 1),
        f21(s1, s2*2, step + 1)
    ]

    # ПОБЕДИТЕЛЬ ВСЕГДА any()
    # ПРОИГРАВШИЙ all() если любой ход/независимо от стратегии...
    # ПРОИГРАВШИЙ any() когда НЕУДАЧНЫЙ ХОД
    if step%2 == 0: # четные ходы - ВАНЯ
        return any(moves)
    # нечетные - ПЕТЯ
    return all(moves)

for s2 in range(2, 190):
    if f21(17, s2):
        print(s2)
        # break

# 3 или 5 ход
85
93


