# 1) Перевести следующие числа в двоичную систему
# 787, 128, 513

# В идеале попробовать проверить делением в столбик


# 2) Получить следующие срезы из строки

# s = "98765ABCDEFG050607"

# 98765AB
# 50607
# 706050GFEDCBA56789
# ACEG567

# 3) дан список чисел
# добавить в конец списка любые 2 трехзначных числа
# убрать в нем повторы
# nums = [5, -3, 19, 14, 5, 7, -3, -2, 5]


# 4) дан список чисел
a = [5, 91, -42, 182, 903]

# увеличить 3ее число на 10
# заменить последнее число на 5
# получить срезом первые 3 числа