# дано число - посчитать количество цифр, с числовым значением больше 4 в
# 16ти ричной системе счисления 

# num = 3**32 + 7*3**15 - 8**14




# fruits = []

# while True:
    # fruit = input("Введите фрукт: ")
    # дописать код, который будет добавлять в список только те фрукты,
    # которых там еще нет
    # если введут 0 - остановить цикл





# написать цикл, который напечатает все числа, кратные 123456
# в промежутке от 10^10 до 2*10^10





# num = 789236
# num_hard = 9346573451234234

# дано число, необходимо найти:
# 1) сумму его цифр
# 2) все делители числа
# 3) простые множители числа
# задача посложнее - все тоже самое, с числом num_hard



# на вход будет подаваться 6 натуральных чисел через пробел
# они сохраняются в список nums (заранее неизвестны - я буду вводить любые
# ты для теста тоже можешь по 6 любых чисел вводить)

# nums = [int(i) for i in input().split()] 

# print(nums)

# если одновременно выполняются все 3 условия - напечатать YES
# если нет - NO
# условия:
# 1) в списке есть повторяющиеся числа
# 2) в списке количество четных и количество нечетных чисел равно
# 3) в списке ровно 3 двузначных числа