# Завершить следующие функции проверки
# все функции возвращают либо True либо False


# 0) Является ли число четным (пример)

def isEven(num):
    return num%2 == 0


# 1) Оканчивается ли число на нечетную цифру

def check1(num):
    ...



# 2) Является ли число полным квадратом


def check2(num):
    ...


# 3) Сумма чисел в списке кратна 5


def check3(nums: list):
    ...


# 4) Строка является палиндромом


def check4(s: str):
    ...


# 5) Является ли список чисел неубывающим


def check5(nums: list):
    ...


# 6) Является ли список чисел возрастающим


def check6(nums: list):
    ...




# 7) Написать функцию перевода числа в 7ричную систему счисления
# функция возвращает строку - запись числа в 7ричной СС


def to_7(num):
    ...