text = "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean vulputate est vitae purus consequat commodo."

# 1) Посчитать кол-во гласных в тексте
# 2) Найти кол-во слов в тексте
# 3) Убрать все знаки препинания (есть несколько способов - подумай каким проще)


s = "QWERTY56789ASD0123"

# Получить следующие строки при помощи срезов:
# QWERTY56
# 9ASD01
# QR58
# Q
# SD0123
# 31D
# WERTY56789ASD012

print(s[::-1])



# Дан список чисел - заполнить параметры методов, чтобы получился следующий список
nums = [90, 78, 75, 55, 90]
nums.append()
nums.append()

# [90, 78, 75, 55, 90, 12, 34]

# Отсортировать список по возрастанию


# Имеется список покупок
basket = ["apple", "banana", "orange", "apple", "kiwi", "banana", "banana"]

# Выведи количество (!) уникальных фруктов в корзине
# Добавь в этот список "pineapple" и удали из списка дубли (конечный тип данных - list)




# Вывести 1ую, 2ую, 3юю цифры трехзначного числа не используя строки, а только
# математические операции
num = 587