# Типы данных
# типы данных определяют какую операцию должен выполнить интерпретатор 
# если мы используем конкретный оператор

# 5 + 7 - 5 и 7 это операнды + это оператор

# print(5 + 5) # int - число, + это математическое сложение
# print("5" + "5") # str - строка, + это операция конкатенации

# num = 5
# bin_num = bin(num)[2:]


# 1) Числа - целые int, вещественные (числа с плавающей точкой) 
# НЕИЗМЕНЯЕМЫЙ ТИП ‼️‼️‼️
# num = 15 # int
# num2 = 3.3 # float

# float - 16 цифр + одна 17ая (в редких случаях)
# 5.0000000000000004 7 

# действия с числами
# Стандартные мат действия + - * 
# деление - 3 типа
# 1) обычное деление / (результат всегда float)
# 2) целочисленное деление // - отбрасывает дробную часть
# 3) остаток от деления %


# print(10//3)
# 3.6666 6666 6666 6665

# возведение в степень
# **

# print(2**3)

# корень n-ой степени
# print(64**(1/3))

# представление целых чисел в компьютере
# любое целое (!) число можно представить в виде суммы степеней двойки

# 575 = 512 + 32 + 16 + 8 + 4 + 2 + 1

# представление вещественных чисел в компьютере
# 0.625 = 0.5 + 0.125 = 1/2 + 1/8
# 0.626 = 0.5 + 0.125 + 0.001 = 1/2 + 1/8 + ?

# везде, где можно избежать вещественные числа, мы их избегаем ‼️‼️‼️

# print(0.15 + 0.15)
# print(0.1 + 0.2)

# порядок действий как в математике
# 1) скобки
# 2) степень
# 3) умножение
# 4) сложение



# строки - символьный тип данных
# НЕИЗМЕНЯЕМЫЙ ТИП ‼️‼️‼️
# любые числа не в десятичной системе записываются как строки ‼️‼️
# строки начинаются и закачиваются символом кавычек, одинарных или двойных

# задача: Напечатать название книги - Лев Толстой "Война и мир"
# print("Лев Толстой \n \t \"Война и мир\"")
# print('Лев Толстой "Война и мир"')


# Функции и методы
# print() range() int() len() str() - функции
# функция берет на вход какой-то объект и работает с ним

# методы - это функции конкретного класса, они пишутся ПОСЛЕ объекта через точку
# все методы это функции, не все функции это методы
# "hello".upper()


# cat = Cat() # Cat() - класс
# dog = Dog() # Dog() - класс

# # если нам нужно накормить кошку и собаку
# feed(cat)
# feed(dog)

# cat.meow()
# dog.bark()

# cat.walk()
# dog.walk()



# строковые методы - методы строк

# s = "Hello world! 0123456789"

# print(s.upper()) # верхний регистр (большие буквы)
# print(s.lower()) # нижний регистр

# print(s.count("o")) # кол-во подстрок (!!!) в строке

# print(s.index("w")) # возвращает индекс первого вхождения слева подстроки
# отсчет идет с нуля!!

# если тебе надо проверить входит какая-то буква/подстрока
# в строку или нет мы делаем так

# if "a" in s:
#     print("Входит")
# else:
#     print("Не входит")

# s = "Hello wooooorld! 0123456789"

# print(s.replace("o", "_", 1))


s = 'ABC   ABC   abcb     abc  abc abc'

# задача - посчитать количество слов в тексте
words = s.split() # list - список
print(words)
# обратная операция - .join()

print("_".join(words))
