# Срезы/slice

# s = '0123456789ABCDEF'

# s[start:stop:step]
# start=0 (по умолчанию 0) включается
# stop - не включительно
# step=1 (по умолчанию 1)



# range(start, stop, step)
# range(10)
# range(0, 10, 1)

# 345678
# 0123456
# CDEF
# 2468A
# EDCB

s = '0123456789ABCDEF'
# print(s[0:10]) # s[0:10:1]

# print(s[3:9])
# print(s[:7])
# print(s[12:])
# print(s[-4:])
# # print(s[2:11:2])

# print(s[-2:10:-1])


# print(s[:5]) # первые 5 символов
# print(s[::-1]) # 0:до конца:-1
# print(s[::2])

# цифры - это символы, которыми записываются числа (могут быть и арабскими и римскими и буквами и знаками)
# число - это количественная мера (что-то посчитано)


# num = 2423

# print(bin(num)[2:])
# print(oct(num)[2:])
# print(hex(num)[2:])


# s = '0123456789ABCDEF'

# # 0123456789ABC
# # 58BE
# # 7531
# # 89ABC

# print(s[:])


# Коллекции
# строки - неизменяемый тип
# списки - list [1, 2, 3] - изменяемый тип
# кортежи - tuple - неизменяемый список (1, 2, 3)
# множество - set - (математическое множество) неизменяемый ‼️‼️‼️‼️ НЕСОРТИРУЕМЫЙ ‼️‼️‼️‼️ {1, 2, 3}

# s = "hello"
# s = s[:3] + "t" + s[4:]
# print(s)


# nums = [6, -4, 8, 1, 3, -9]

# # print(nums[2]) # доступен вызов элемента по индексу

# # доступно изменение элемента по индексу
# nums[2] = 155
# print(nums)


# list_1 = [1, True, "hello", [0, 1, 2]]

# Списковые методы
nums = [6, -4, 8, 1, 3, -9]

# 1) добавить элемент в конце списка
# nums.append(3)

# print(nums)
# print(nums.count(3))
# print(nums.index(8))

# # сортируем ТОЛЬКО ПРИ ПОМОЩИ ФУНКЦИИ!!!!
# print(sorted(nums, reverse=True))



# множества - математические 
# ‼️‼️‼️НЕТ ПОРЯДКА‼️‼️‼️‼️
# НЕТ ПОВТОРОВ

# nums = {1, 2, 3, 4}


# s = [1, 2, 3, 3, 4, 5]

# if len(s) == len(set(s)):
#     print("YES")
# else:
#     print("NO")

# nums = {14234023848230482304823402385493590345435, 2, 323543953459345345345, 4}
# nums.add(-345934054386456450968456730570657567)
# print(nums)


nums =  {-124235345, 5345, -54689457684506, 10**20}

for i in range(4357634593245, 4357634593245 + 50):
    nums.add(i)

print(sorted(nums))