for x in range(-1000, 1000):
    if (
        (not x<= 15) and (x < 20)
    ):
        print(x)


# НЕ (X <= 15) 
# (not x <= 15)


# / - обычное деление
# // - целочисленное деление
# % - остаток от деления


# если у тебя 17 рублей и что-то стоит 5 рублей
# ты можешь купить

# 17//5 = 3 предмета

# у тебя останется

# 17%5 = 2 рубля


# Если у нас есть число

# num = 12345

# Последняя цифра

# num%10

# Предпоследняя -

# num//10%10


# 3яя справа цифра - 
# num//100%10



# num%a == 0
# значит num кратен a (число делится на a без остатка)