# 1) Типы данных
# 2 числовых - целые числа и вещественный

# int - целые числа
# float - вещественные (5.0)


# a + b выражение
# a и b - операнды
# + - оператор

# операции с числами
# + - * сложение вычитание и умножение

# три вида деления
# 1) / обычное деление (результат - float)
# 2) // целочисленное деление 
# 3) % остаток от деления


# money = 100
# price = 15


# kol_vo_kg = money/price # когда мы можем получить дробную часть

# kol_vo_predmetov = money//price 
# sdacha = money%price

# остаток от деления используется в случаях
# 1) проверка кратности
# число n кратно числу m если остаток от деление n на m равен 0

# if n%7 == 0:
#     print("n кратно 7")

# 2) разбить бесконечное/конечное на конечное кол-во групп

# for n in range(100):
#     print(n, n%5) # 5 команд


# возведение в степень и корень n-ой степени

# n**(1/2)

# n**0.5
# n**.5


# Строки - текстовый тип
# str "Hello" 'Hello'

# ‼️‼️строки - НЕИЗМЕНЯЕМЫЙ тип‼️‼️

# s = "0123456789ABCDEF"


# строковые методы

# cat = Cat() # Cat() - класс, cat - экземпляр класса
# dog = Dog()


# функции - это кусок кода, который можно переиспользовать
# это действие НАД объектом


# метод - функция, принадлежащая классу, действие ОБЪЕКТА
# любой метод это функция, не любая функция это метод

# нам нужно накормить кошку и собаку

# def feed(animal):
#     ...


# feed(cat)
# feed(dog)



# # нам нужно, чтобы кошка мяукнула и собака лаяла

# cat.meow()
# dog.bark()


# # нужно, чтобы кошка и собака ходила


# cat.walk()
# dog.walk()



# Строковые методы
# методы которые работают ТОЛЬКО со строкам


# s = "0123456789abcDEF"

# print(s.lower()) # .upper() нижний/верхний регистры

# print(s.count("ABC")) # sub = substring подстрока


# вызов элемента строки по индексу

# print(s[5])
# print(s.find("+"))
# print(s.index("+"))

# s = "0123456789abcDEF5555"

# print(s.replace("5", "_", 2))

# text = "JHFbf gdf \t bjgk   reproi  \n fdsib   napfk ffdspgf"


# print(text)
# print(text.split(" "))
# print(text.split())

s = "aaaaaABBABABAABABaaaaaABABABBABABAaaaaa"

# print(s.strip("a"))
# print(s.lstrip("a"))
# print(s.rstrip("a"))

ip = "102.54.7.9"
bin_ip = [bin(int(i))[2:].zfill(8) for i in ip.split('.')]

print(bin_ip)

['1100110', '110110', '111', '1001']
['01100110', '00110110', '00000111', '00001001']