# Типы данных - нужны, чтобы пк понял, какую операцию проводить над данными
# операции обозначаются операторами
# объекты, учавствующие в действии - операнды


# Основные типы данных

# числовые - int и float

# коллекции:
# строковый тип (текстовый) - string

# списки list 
# кортежи tuple - неизменяемый список
# словари dict (ключ-значение)
# множества set - математическое


# nums = set()

# for i in [-123, -5, 2, 7, 10, 15, -98]:
#     nums.add(i)


# print(nums)


# Операции над числами
# +, -, *

# возведение в степень - **

# 3 вида деления
# обычное деления /
# целочисленное //
# остаток от деления %



# s = "abababbabababa"


# if "a" in s:
#     print("a in s")


# if "b" in s:
#     print("b in s")
